{
  "Sheet1": [
    {
      "album_name": "Taylor Swift",
      "year": 2006,
      "rank": 8.82,
      "blurb": "Taylor Swift's debut album Taylor Swift, called debut by Swifites, was originally released on October 24, 2006 under Big Machine Records, and was produced by Nathan Chapman and Robert Ellis Orrall. A second version of the album was released in 2009 due to a lyric change on \"Picture to burn,\" but the original lyrics are still in the music video if you're curious. My favorite song off this album is \"Mary's Song (Oh My My My).\"",
      "spotify_link": "https://open.spotify.com/album/7mzrIsaAjnXihW3InKjlC3?si=0wH9pwq1Sn6O-LjDGcgNig",
      "slug": "debut"
    },
    {
      "album_name": "Fearless",
      "year": 2009,
      "rank": 8.611,
      "blurb": "Fearless was released November 11, 2008 under Big Machine Records, and was produced by Nathan Chapman and Taylor Swift. Fearless Platinum Edition was released October 26, 2009 with six additional tracks. My favorite song off this album is \"Fifteen.\"",
      "spotify_link": "https://open.spotify.com/album/43OpbkiiIxJO8ktIB777Nn?si=-KVASEWJTOu9aR6RA-spmA",
      "slug": "fearless"
    },
    {
      "album_name": "Speak Now",
      "year": 2010,
      "rank": 9.46,
      "blurb": "Speak Now was released October 25, 2010 under Big Machine Records, and was produced by Nathan Chapman and Taylor Swift. This album was written entirely by Swift, since at the time many people did not believe she wrote her own music. The deluxe version was released with six additional tracks. My favorite song off this album is \"Innocent.\"",
      "spotify_link": "https://open.spotify.com/album/5EpMjweRD573ASl7uNiHym?si=0BO1D5mYSU2M8gKnbLpHRQ",
      "slug": "speak-now"
    },
    {
      "album_name": "Red",
      "year": 2012,
      "rank": 7.81,
      "blurb": "Red was released October 22, 2012 under Big Machine Records, and was produced by Taylor Swift, Nathan Chapman, Jeff Bhasker, Dann Huff, Jacknife Lee, Max Martin, Shellback, Butch Walker, and Dan Wilson. The deluxe version of this album was released with an additional six tracks. My favorite song off this album is \"Begin Again.\"",
      "spotify_link": "https://open.spotify.com/album/1KlU96Hw9nlvqpBPlSqcTV?si=IN5cPQQITiWjJPPsq06VcQ",
      "slug": "red"
    },
    {
      "album_name": 1989,
      "year": 2014,
      "rank": 9.21,
      "blurb": "1989 was released October 27, 2014 under Big Machine Records, and was produced by Max Martin, Taylor Swift, Shellback, Jack Antonoff, Ryan Tedder, Noel Zancanella, Ali Payami, Nathan Chapman, Imogen Heap, and Mattman & Robin. The deluxe version of this album was released on January 1, 2014 with an additional 6 tracks, 3 of which are voice memos. 1989 was Swift's first pop album. My favorite song off this album is \"You Are In Love.\"",
      "spotify_link": "https://open.spotify.com/album/34OkZVpuzBa9y40DCy0LPR?si=o3wDoGAFRmaaA3jnIvcfJw",
      "slug": 1989
    },
    {
      "album_name": "reputation",
      "year": 2017,
      "rank": 9.78,
      "blurb": "reputation was released November 10, 2017 under Big Machine Records, and was produced by Taylor Swift, Max Martin, Shellback, Jack Antonoff, Ali Payami, Oscor Gorres, and Oscar Holter. This was her final album under Big Machine. reputation is my favorite Taylor Swift album, and my favorite song off of it is \"So it goes....\"",
      "spotify_link": "https://open.spotify.com/album/6DEjYFkNZh67HP7R9PSZvv?si=xkroFX-pSFavIWsIaMSSTA",
      "slug": "reputation"
    },
    {
      "album_name": "Lover",
      "year": 2019,
      "rank": 8.88,
      "blurb": "Lover was released on August 23, 2019 under Republic Records, and was produced by Taylor Swift, Jack Antonoff, Joel Little, Louis Bell, and Frank Dukes. Alongside the album, Swift released four different diary notebooks for fans to purchase that included excerpts from her diaries and unreleased song lyrics.  Lover was her first album under Republic. My favorite song off this album is \"It's Nice To Have A Friend.\"",
      "spotify_link": "https://open.spotify.com/album/1NAmidJlEaVgA3MpcPFYGq?si=c2ifrwLkSpO0Ph-ktE--NA",
      "slug": "lover"
    },
    {
      "album_name": "folklore",
      "year": 2020,
      "rank": 9.02,
      "blurb": "folklore was released July 24, 2020 under Republic Records, and was produced by Aaron Dessner, Jack Antonoff, Taylor Swift, and Joe Alwyn. The deluxe version was released August 18, 2020 with an additional song. Swift surprise dropped this album without any promotion. My favorite song off folklore is \"this is me trying.\"",
      "spotify_link": "https://open.spotify.com/album/1pzvBxYgT6OVwJLtHkrdQK?si=9R3kYkvZQtCMHQ3PNhdrjg",
      "slug": "folklore"
    },
    {
      "album_name": "evermore",
      "year": 2020,
      "rank": 8.7,
      "blurb": "evermore was released December 11, 2020 under Republic Records, and was produced by Aaron Dessner, Taylor Swift, Jack Antonoff, and Bryce Dessner. The deluxe album was released on January 7, 2021 with two additional songs. Swift surprise dropped this album without any promotion. My favorite song off evermore is \"tolerate it.\"",
      "spotify_link": "https://open.spotify.com/album/2Xoteh7uEpea4TohMxjtaq?si=l1--Cib7QYCbA-_RvOjFrQ",
      "slug": "evermore"
    },
    {
      "album_name": "Fearless (Taylor's Version)",
      "year": 2021,
      "rank": 7.84,
      "blurb": "Fearless (Taylor's Version) was released April 9, 2021 under Republic Records, and was produced by Taylor Swift, Christopher Rowe, Jack Antonoff, and Aaron Dessner. There are six vault tracks on this album. My favorite vault track from this re-record is \"You All Over Me (feat. Maren Morris).\"",
      "spotify_link": "https://open.spotify.com/album/4hDok0OAJd57SGIT8xuWJH?si=w32J9w_iR9Olhtp9ihXFGg",
      "slug": "fearless-tv"
    },
    {
      "album_name": "Red (Taylor's Version)",
      "year": 2021,
      "rank": 8.12,
      "blurb": "Red (Taylor's Version) was released November 12, 2021, and was produced by Taylor Swift, Christopher Rowe, Shellback, Aaron Dessner, Jack Antonoff, Elvira Anderfjärd, Dan Wilson, Jeff Bhasker, Jacknife Lee, Butch Walker, and Espionage. There are nine vault tracks on this album. I have excluded \"Ronan (Taylor's Version)\" from my rankings. My favorite vault track from this re-record is \"All Too Well (10 Minute Version) (Taylor's Version).\"",
      "spotify_link": "https://open.spotify.com/album/6kZ42qRrzov54LcAk4onW9?si=c_UqAA1ZTjqKTcFjphQHHA",
      "slug": "red-tv"
    },
    {
      "album_name": "Midnights",
      "year": 2022,
      "rank": 9.09,
      "blurb": "Midnights was released October 21, 2022 under Republic Records, and was produced by Taylor Swift, Jack Antonoff, Sounwave, Jahaan Sweet, and Keanu Beats. There are four additional variations of Midnights (3am Edition, Lavender Edition, The Til Dawn Edition, and the limited CD only sold as the East Rutherford Eras Tour shows) with 11 additional songs in total. My favorite song off the album is \"Glitch.\"",
      "spotify_link": "https://open.spotify.com/album/1fnJ7k0bllNfL1kVdNVW1A?si=rX3k6h1SSuyqY9o0bkrlCA",
      "slug": "midnights"
    },
    {
      "album_name": "Speak Now (Taylor's Version)",
      "year": 2023,
      "rank": 9.15,
      "blurb": "Speak Now (Taylor's Version) was released July 7, 2023 under Republic Records, and was produced by Taylor Swift, Christopher Rowe, Aaron Dessner, and Jack Antonoff. There are six vault tracks on this album. My favorite vault track on this re-record is \"I Can See You (Taylor's Version).\"",
      "spotify_link": "https://open.spotify.com/album/5AEDGbliTTfjOB8TSm1sxt?si=iC3WMOtKTk21tGEWJlQ5ZA",
      "slug": "speak-now-tv"
    },
    {
      "album_name": "1989 (Taylor's Version)",
      "year": 2023,
      "rank": 9.14,
      "blurb": "1989 (Taylor's Version) was released October 27, 2023 under Republic Records, and was produced by Taylor Swift, Christopher Rowe, Jack Antonoff, Ryan Tedder, Noel Zancanella, Imogen Heap, Shellback, and Patrik Berger. There are five vault tracks on this album. My favorite vault track on this re-record is \"Now That We Don't Talk (Taylor's Version).\"",
      "spotify_link": "https://open.spotify.com/album/1o59UpKw81iHR0HPiSkJR0?si=IIeEBywAQa-P_MPlNOduzw",
      "slug": "1989-tv"
    },
    {
      "album_name": "The Tortured Poets Department",
      "year": 2024,
      "rank": 7.9,
      "blurb": "The Tortured Poets Department was released on April 19, 2024 - the day after my birthday - under Republic Records, and was produced by Taylor Swift, Jack Antonoff, Aaron Dessner, and Patrik Berger. The Anthology version was released with 15 additional songs. My favorite song off the album is \"I Hate It Here.\"",
      "spotify_link": "https://open.spotify.com/album/5H7ixXZfsNMGbIE5OBSpcb?si=8qKcFqmcRdKtK9fzj19KYw",
      "slug": "ttpd"
    }
  ]
}
